# Section 1

## 1

In [1]:
st = "This is the first python test"

In [2]:
vow = ['a','e','i','o','u']

In [3]:
vow_list = []
cons_list = []

In [4]:
for i in st:
    if i.isalpha():
        if i.lower() in vow:
            vow_list.append(i)
        else:
            cons_list.append(i)

In [5]:
print(vow_list)

['i', 'i', 'e', 'i', 'o', 'e']

In [6]:
print(cons_list)

['T', 'h', 's', 's', 't', 'h', 'f', 'r', 's', 't', 'p', 'y', 't', 'h', 'n', 't', 's', 't']

## 2

In [7]:
def k_large(l,k):
    l.sort(reverse=True)
    return l[k-1]

In [8]:
k_large([2,4,12,8,6,9,10],2)

10

## 3

In [9]:
import numpy as np

In [10]:
arr = np.array([2,4,6,2,6,4,8,9,7,7,8,9,8])

In [11]:
arr

array([2, 4, 6, 2, 6, 4, 8, 9, 7, 7, 8, 9, 8])

In [12]:
uq,cnt = np.unique(arr,return_counts=True)

In [13]:
uq[np.where(cnt==3)[0][0]]

8

Number 8 is repeated thrice

## 4

### i.

In [14]:
A = np.array([1,2,3])
B = np.array([2,4,5])

### ii.

In [56]:
np.multiply(A,B)

array([ 2,  8, 15])

### iii.

In [16]:
C = (A+B)/2
print(C)

[1.5 3.  4. ]

### iv.

In [17]:
A_C = np.sum(np.square(A-C))
print("Distance between A and C",A_C)

Distance between A and C 2.25

In [18]:
B_C = np.sum(np.square(B-C))
print("Distance between B and C",B_C)

Distance between B and C 2.25

## 5

In [19]:
[i**2 for i in range(10)]

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

# Section 2

In [20]:
import pandas as pd

In [22]:
bank_df = pd.read_csv("bank.csv",sep=";")
bank_df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

### a

In [48]:
print("The most common Job is ",bank_df.job.value_counts().idxmax())

The most common Job is  management

### b

In [65]:
bank_df.loc[(bank_df.marital == 'married') & (bank_df.education == 'tertiary')].balance.mean()

1860.71939477304

### c

In [68]:
bank_df.groupby(['education']).mean()[['age']]

                 age
education
primary    46.833333
secondary  40.062446
tertiary   39.645926
unknown    45.299465

### d

In [71]:
bank_df = bank_df.drop(['job', 'day', 'month', 'pdays', 'previous', 'poutcome'],axis=1)

In [72]:
bank_df.head()

,age,marital,education,default,balance,housing,loan,contact,duration,campaign,y
0,30,married,primary,no,1787,no,no,cellular,79,1,no
1,33,married,secondary,no,4789,yes,yes,cellular,220,1,no
2,35,single,tertiary,no,1350,yes,no,cellular,185,1,no
3,30,married,tertiary,no,1476,yes,yes,unknown,199,4,no
4,59,married,secondary,no,0,yes,no,unknown,226,1,no

### e

In [105]:
bank_df = bank_df.replace("yes",value=1).replace("no",0)

In [106]:
bank_df.head()

,age,marital,education,default,balance,housing,loan,contact,duration,campaign,y
0,30,married,primary,0,1787,0,0,cellular,79,1,0
1,33,married,secondary,0,4789,1,1,cellular,220,1,0
2,35,single,tertiary,0,1350,1,0,cellular,185,1,0
3,30,married,tertiary,0,1476,1,1,unknown,199,4,0
4,59,married,secondary,0,0,1,0,unknown,226,1,0